<?php

use Illuminate\Database\Seeder;

class AttributesTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $params = collect([
            ['name' => 'The.level.of.analytical.readiness', 'parameter' => '0.52529000', 'min' => '0.00000000', 'max' => '1.00000000'],
            ['name' => 'The.patent.level', 'parameter' => '-0.31836000', 'min' => '0.00000000', 'max' => '1.00000000'],
            ['name' => 'Вільний член', 'parameter' => '3.40463000', 'min' => '1.00000000', 'max' => '1.00000000'],
            ['name' => 'The.demand.readiness.level', 'parameter' => '-0.44677000', 'min' => '0.00000000', 'max' => '1.00000000'],
            ['name' => 'The.society.impact.level', 'parameter' => '0.98813000', 'min' => '0.00000000', 'max' => '1.00000000'],
            ['name' => 'За.віком.розробників', 'parameter' => '1.20999000', 'min' => '1.00000000', 'max' => '3.00000000'],
            ['name' => 'За.рівнем.глибини.змін..що.зумовлює.технологія', 'parameter' => '-0.14884000', 'min' => '1.00000000', 'max' => '3.00000000'],
            ['name' => 'За.ступенем.розповсюдження', 'parameter' => '0.68415000', 'min' => '1.00000000', 'max' => '3.00000000'],
            ['name' => 'Залежно.від.технологічних.параметрів', 'parameter' => '-0.17550000', 'min' => '1.00000000', 'max' => '3.00000000'],
            ['name' => 'За.сферами.розробки.і.планування', 'parameter' => '0.03263000', 'min' => '1.00000000', 'max' => '3.00000000'],
            ['name' => 'За.охопленням.очікуваної.частки.ринку', 'parameter' => '-0.17791000', 'min' => '1.00000000', 'max' => '3.00000000'],
            ['name' => 'За.типом.новизни.для.ринку', 'parameter' => '-0.07564000', 'min' => '1.00000000', 'max' => '3.00000000'],
            ['name' => 'Рівень.освіти.розробника', 'parameter' => '-1.16970000', 'min' => '1.00000000', 'max' => '3.00000000'],
            ['name' => 'За.сферою.наукового.дослідження', 'parameter' => '0.30483000', 'min' => '1.00000000', 'max' => '3.00000000'],
            ['name' => 'За.способами.і.методами.одержання.нового.знання', 'parameter' => '0.26846000', 'min' => '1.00000000', 'max' => '3.00000000'],
            ['name' => 'За.видом.наукового.дослідження', 'parameter' => '0.34420000', 'min' => '1.00000000', 'max' => '3.00000000'],
            ['name' => 'За.соціальним.статусом.розробника', 'parameter' => '-1.04556000', 'min' => '1.00000000', 'max' => '5.00000000'],
            ['name' => 'За.спрямуванням.технології.для.споживача', 'parameter' => '-0.33284000', 'min' => '1.00000000', 'max' => '3.00000000'],
            ['name' => 'За.спрямованістю.дій', 'parameter' => '0.02247000', 'min' => '1.00000000', 'max' => '4.00000000'],
            ['name' => 'За.обсягом', 'parameter' => '-0.05157000', 'min' => '1.00000000', 'max' => '3.00000000'],
            ['name' => 'За.інноваційним.потенціалом', 'parameter' => '0.17842000', 'min' => '1.00000000', 'max' => '3.00000000'],
        ]);

        $params->each(function ($item) {
            \App\Models\Attribute::query()->firstOrCreate([
                'name' => $item['name']
            ], $item);
        });
    }
}
